## **How dplyr can help you in easy five ways?**

If you want to manipulate your data in R then `dplyr` package is your best choice. The code written with `dplyr` is a very easy read even for a non-technical person. 

It is part of the `tidyverse` package, so when you install `tidyverse` it automatically installs `dplyr`. 

There are a few commands are there in the `dplyr` which are popularly known as the 'verb' of `dplyr` but they are very powerful commands. 

Here we are going to explore five verbs of **dplyr**; **arrange()**, **select()**, **filter()**, **mutate()** and **summarise()**, finally we will see how we can combine all of them and do our data exploration journey.

We will start by installing `tidyverse` package. And we call `tidyverse` in our environment it automatically installs `dplyr` as well.

In [1]:
#install.packages("tidyverse")
library("tidyverse")

Warning message in system("timedatectl", intern = TRUE):
“running command 'timedatectl' had status 1”
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.1 ──

✔ ggplot2 3.4.0      ✔ purrr   0.3.5
✔ tibble  3.1.8      ✔ dplyr   1.0.10
✔ tidyr   1.2.1      ✔ stringr 1.4.1
✔ readr   2.1.3      ✔ forcats 0.5.2

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

Before we start exploring the capabilities of `dplyr`, we will first create a data frame and then continue our operation on the same.

Here, we are using the **data_frame()** function to create a data frame. For each column, we have a vector that are containing different information about the employees. We have a data frame called 'emp' and it contains five columns namely 'name', 'gender', 'salary', 'age', and 'phone'.

In [2]:
emp <- data_frame(
  name = c("Cian", "Donal", "Megan", "Mari", "Neil", "Kate"),
  gender = c("male", "male", "female", "female", "male", "female"),
  salary = c(60000, 63500, 48000, 55000, 65000, 57000),
  age = c(32, 38, 40, 47, 35, 30),
  phone = c(1,2,1,2,2, 2)
)

Warning message:
“`data_frame()` was deprecated in tibble 1.1.0.
ℹ Please use `tibble()` instead.”

Now we have created the data frame, let's check the data it contains.

In [3]:
head(emp)

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Donal male   63500  38  2
3 Megan female 48000  40  1
4 Mari  female 55000  47  2
5 Neil  male   65000  35  2
6 Kate  female 57000  30  2

As we can see we have created the data frame successfully. Now, we will continue with the data manipulation operation with `dplyr`.

### **ARRANGE**

The **arrange()** basically sort the data based on the input column(s). By default, it sorts the data in ascending order. Here, we can see an example sort the data on the number of phones each employee owns.

In [4]:
emp %>% arrange(phone)

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Megan female 48000  40  1
3 Donal male   63500  38  2
4 Mari  female 55000  47  2
5 Neil  male   65000  35  2
6 Kate  female 57000  30  2

If we want to sort the data in descending order then we need to use the **desc("column name")** function, inside the arrange function.

In [5]:
emp %>% arrange(desc(salary))

  name  gender salary age phone
1 Neil  male   65000  35  2
2 Donal male   63500  38  2
3 Cian  male   60000  32  1
4 Kate  female 57000  30  2
5 Mari  female 55000  47  2
6 Megan female 48000  40  1

The `arrange()` function work on multiple columns and the precedence will take place from left to right. For example, first, we want to sort the data in ascending order on the number phone and then sort the data on the age column but that will be in descending order, in that case, we will write the following code.

In [6]:
emp %>% arrange(phone, desc(age))

  name  gender salary age phone
1 Megan female 48000  40  1
2 Cian  male   60000  32  1
3 Mari  female 55000  47  2
4 Donal male   63500  38  2
5 Neil  male   65000  35  2
6 Kate  female 57000  30  2

### **SELECT**

As the name suggests, the **select()** function basically selects the column(s) that we define inside the select() function.

If we like to select only the columns `name` and `salary` then we need to write the name of these columns inside the select() function.

In [7]:
emp %>%
  select(name, salary)

  name  salary
1 Cian  60000
2 Donal 63500
3 Megan 48000
4 Mari  55000
5 Neil  65000
6 Kate  57000

The negative sign in front of column(s) indicates that we do not want to select that column. For example, if we want to see all the columns except the 'age' column then we will write the following code.

In [8]:
emp %>% 
  select(-age)

  name  gender salary phone
1 Cian  male   60000  1
2 Donal male   63500  2
3 Megan female 48000  1
4 Mari  female 55000  2
5 Neil  male   65000  2
6 Kate  female 57000  2

If we like to discard multiple columns then we can use a vector for the name of the columns.

In [9]:
emp %>% 
  select(-c("age", "phone"))

  name  gender salary
1 Cian  male   60000
2 Donal male   63500
3 Megan female 48000
4 Mari  female 55000
5 Neil  male   65000
6 Kate  female 57000

The select() function also arranges the column in the order we like to see them, for example, if went to see the `name` first and then `phone` and then the `salary` column then we will write the following code.

In [10]:
emp %>% 
  select(name, phone, salary)

  name  phone salary
1 Cian  1     60000
2 Donal 2     63500
3 Megan 1     48000
4 Mari  2     55000
5 Neil  2     65000
6 Kate  2     57000

 If we have a situation in which we are interested to see a few column(s) in the front and then the rest of the columns as it is, in that case, it is tedious to write down the name of each of the columns one after another. Instead, we will write the name of the column(s) that we are interested in at the beginning and followed by another function called **everything()**.

In [11]:
emp %>%
  select(name, age, everything())

  name  age gender salary phone
1 Cian  32  male   60000  1
2 Donal 38  male   63500  2
3 Megan 40  female 48000  1
4 Mari  47  female 55000  2
5 Neil  35  male   65000  2
6 Kate  30  female 57000  2

### **FILTER**

The **filter()** is used to select the rows from a dataset based on the filter criteria. For example, we like to see employees who have a single phone.

In [12]:
emp %>%
  filter(phone == 1)

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Megan female 48000  40  1

We can use both the `AND` and `OR` operators to have multiple selection criteria. Here, we have an example where we like to see employees who are female and earn a salary of more than 50000.

In [13]:
emp  %>% 
  filter(gender == "female" & salary >= 50000)

  name gender salary age phone
1 Mari female 55000  47  2
2 Kate female 57000  30  2

In [14]:
emp  %>% 
  filter(gender == "female" | salary >= 63000)

  name  gender salary age phone
1 Donal male   63500  38  2
2 Megan female 48000  40  1
3 Mari  female 55000  47  2
4 Neil  male   65000  35  2
5 Kate  female 57000  30  2

Let's say, we want to see the record of a few employees and we are filtering by their name. In that case, we can use multiple OR operators to filter the data.

In [15]:
emp %>%
  filter(name == "Cian" | name == "Neil" | name == "Megan")

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Megan female 48000  40  1
3 Neil  male   65000  35  2

As we understand using multiple OR operators is not a very efficient way to write the code, instead, we can use the `%in% `operator along with a vector.

In [16]:
emp %>%
  filter(name %in% c("Cian", "Neil", "Megan"))

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Megan female 48000  40  1
3 Neil  male   65000  35  2

### **FILTER WITH GROUP BY**

The **group_by()** is a function that actually groups the data based on the given column, e.g. let's say we like to perform some operation based on gender then first we need to use **group_by()** on the gender column, and then we can perform the respective operation. We can think when we use the **group_by()** on the gender column the system creates two different data frame for the gender and wait for the next round of operation. 

Let's say we like the average salary for each other gender then we will execute the following task on the data frame.

In [17]:
emp

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Donal male   63500  38  2
3 Megan female 48000  40  1
4 Mari  female 55000  47  2
5 Neil  male   65000  35  2
6 Kate  female 57000  30  2

In [18]:
emp %>% group_by(gender) %>% 
  summarise(mean_salary=mean(salary))

  gender mean_salary
1 female 53333.33
2 male   62833.33

And then we like to see the records for which the salary is less than the mean salary but we like to see it for both genders separately. 

In that case, we will use **group_by()** and **filter()** together.

In [19]:
emp %>%
  group_by(gender) %>%
  filter(salary  <= mean(salary))

  name  gender salary age phone
1 Cian  male   60000  32  1
2 Megan female 48000  40  1

### **MUTATE**

Until now, we have arranged the data or selected different columns and we have also seen how to filter the records. But we do not make any changes to the actual dataset. 

And with the **mutate()** function we can actually change the dataset.

Let's say we like to include the information about the department of each of the employees then we can do so by using **mutate()** and a new column.

In [20]:
emp <- emp %>%
  mutate(dept = c("IT", "IT", "Marketing", "Finance", "Finance", "Admin"))

We can also create a new column based on the existing column(s). Let's say we want to have a new column called `new_sal` which is 15% higher than the existing salary.

In [21]:
emp <- emp %>%
  mutate(new_sal = salary*1.15)

By default, the new column will be added at the end of the data frame, but we also define the location of the new column with the `.after` and `.before `of options.

Let's say we want to create a new column that shows who gets the higher (>60000) salary and we want to have that column after the salary column.

In [22]:
emp <- emp %>%
  mutate(high_sal = salary > 60000, .after = salary)

In [23]:
emp

  name  gender salary high_sal age phone dept      new_sal
1 Cian  male   60000  FALSE    32  1     IT        69000
2 Donal male   63500   TRUE    38  2     IT        73025
3 Megan female 48000  FALSE    40  1     Marketing 55200
4 Mari  female 55000  FALSE    47  2     Finance   63250
5 Neil  male   65000   TRUE    35  2     Finance   74750
6 Kate  female 57000  FALSE    30  2     Admin     65550

We can even create a new column based on the existing column implying some conditions, e.g. we want to create a column called `mngr` and it will say 'Y' where the high_salary is TRUE else it will say 'N'.

In [24]:
emp %>%
  mutate( mngr= if_else(.$high_sal == TRUE, 'Y', 'N'))

  name  gender salary high_sal age phone dept      new_sal mngr
1 Cian  male   60000  FALSE    32  1     IT        69000   N
2 Donal male   63500   TRUE    38  2     IT        73025   Y
3 Megan female 48000  FALSE    40  1     Marketing 55200   N
4 Mari  female 55000  FALSE    47  2     Finance   63250   N
5 Neil  male   65000   TRUE    35  2     Finance   74750   Y
6 Kate  female 57000  FALSE    30  2     Admin     65550   N

###  **MUTATE WITH GROUP**

Although this is not very popular, we can use mutate() function with the group_by() as well. 

For example, we want to have a column that shows people who earn less than the average salary but the average should be calculated based on the gender of the employee.

In [25]:
emp %>% group_by(gender) %>% 
  summarise(mean_salary=mean(salary))

  gender mean_salary
1 female 53333.33
2 male   62833.33

In [26]:
 df <- emp %>%
  group_by(gender) %>%
  mutate(high_sal_by_gender = salary > mean(salary))

In [27]:
df

  name  gender salary high_sal age phone dept      new_sal high_sal_by_gender
1 Cian  male   60000  FALSE    32  1     IT        69000   FALSE
2 Donal male   63500   TRUE    38  2     IT        73025    TRUE
3 Megan female 48000  FALSE    40  1     Marketing 55200   FALSE
4 Mari  female 55000  FALSE    47  2     Finance   63250    TRUE
5 Neil  male   65000   TRUE    35  2     Finance   74750    TRUE
6 Kate  female 57000  FALSE    30  2     Admin     65550    TRUE

### **SUMMARISE**

Creating a summary of the data is an essential part of data exploration. And `summary()` function of dplyr helps to perform those tasks. 

One such example will be what is the mean salary of the employees? And `summary()` can help us to get the answer.

In [28]:
emp %>%
  summarise(mean_salary = mean(salary))

  mean_salary
1 58083.33

we can use all sorts of summary functions such as mean(), median(), min(), max() etc with the summary()

In [29]:
emp %>%
  summarise(salary_mean = mean(salary),
            salary_median = median(salary),
            min_no_phone = min(phone),
            max_no_phone = max(phone),
            total_emp = n()
            )

  salary_mean salary_median min_no_phone max_no_phone total_emp
1 58083.33    58500         1            2            6

### **SUMMARISE WITH GROUP**

When we use `summarise()` without the `group_by()` then summarise works on the entire dataset. But if we like to summarise the data on some subset of the data then we need to use the `group_by()` function. 

Let's say, we are interested to see what is maximum salary, average salary, and the number of employers for each department then we need to `group_by()` the data on the department column and then we need to apply `summarise()`.

In [30]:
emp %>%
  group_by(dept) %>%
  summarise(mean_sal_dept = mean(salary),
            max_sal_dept = max(salary),
            no_emp = n())

  dept      mean_sal_dept max_sal_dept no_emp
1 Admin     57000         57000        1
2 Finance   60000         65000        2
3 IT        61750         63500        2
4 Marketing 48000         48000        1

The below code is an example of how all the different functions of dplyr is used together to perform a certain task.

In [31]:
emp %>%
  select(-age) %>%
  arrange(salary) %>%
  filter(phone == 2) %>%
  group_by(gender) %>%
    summarise(mean_sal = mean(salary),
              no_emp = n())

  gender mean_sal no_emp
1 female 56000    2
2 male   64250    2

Here, we have discussed 5 functions of dplyr that are most commonly used by data champions. But there are other functions available in dplyr, you can check the following [link](https://dplyr.tidyverse.org/) for detail documentation.